<a href="https://colab.research.google.com/github/zhujunqing1996/2021-TAMU-datathon/blob/main/ENVIRONMENT_DATA_ATLAS.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import os
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
%matplotlib inline
import warnings
from collections import Counter
warnings.filterwarnings('ignore')
from sklearn import metrics

In [ ]:
df = pd.read_csv('https://raw.githubusercontent.com/zhujunqing1996/2021-TAMU-datathon/main/DATASET_atlas_top20%20countries.csv')

In [ ]:
df.head()

       Dataset  ...      Value
0  EDGARED2019  ...  160.99138
1  EDGARED2019  ...  162.29580
2  EDGARED2019  ...  168.19456
3  EDGARED2019  ...  177.85194
4  EDGARED2019  ...  187.06051

[5 rows x 15 columns]

In [ ]:
# No 1: WB mt CO2 from gas solid liquid fuel
Indicator1 = ['CO2 emissions from gaseous fuel consumption', 'CO2 emissions from liquid fuel consumption', 'CO2 emissions from solid fuel consumption']
df_filter1 = df[(df['Dataset'] == 'WBWDI2019Jan') & (df['Year'] >= 1970) & (df['Indicator'].isin(Indicator1))]
print('The unit of the values are: {}, and needs to be changed into Mt.'.format(df_filter1['Unit'].unique()[0]))
df_1 = pd.crosstab(df_filter1.Year, df_filter1.Indicator, values = df_filter1.Value/1000, aggfunc = 'sum')
df_1['Total CO2 (Mt)'] = df_1.sum(axis = 1)
df_1.reset_index(inplace = True)
df_1.head()

The unit of the values are: kt, and needs to be changed into Mt.

Indicator  Year  ...  Total CO2 (Mt)
0          1970  ...    10221.245453
1          1971  ...    10604.890660
2          1972  ...    11124.867593
3          1973  ...    11633.946202
4          1974  ...    11618.068092

[5 rows x 5 columns]

In [ ]:
# No 2: EDG mt CO2
Indicator2 = ['CO2 emissions']
df_filter2 = df[(df['Dataset'] == 'EDGARED2019') & (df['Year'] >= 1970) & (df['Indicator'].isin(Indicator2))]
print('The unit of the values are: {}, and needs to be changed into Mt of CO2.'.format(df_filter2['Unit'].unique()[0]))
df_2 = pd.crosstab(df_filter2.Year, df_filter2.Indicator, values = df_filter2.Value, aggfunc = 'sum')
df_2['Total CO2 (Mt)'] = df_2.sum(axis = 1)
df_2.reset_index(inplace = True)
df_2.head()

The unit of the values are: Mton CO2, and needs to be changed into Mt of CO2.

Indicator  Year  CO2 emissions  Total CO2 (Mt)
0          1970    11944.17929     11944.17929
1          1971    11838.34242     11838.34242
2          1972    12423.75139     12423.75139
3          1973    13141.66995     13141.66995
4          1974    13137.03597     13137.03597

In [ ]:
# No 3: CDI mt CO2 from different sectors
Indicator3 = ['CO2 emissions from bunker fuels', 'CO2 emissions from cement production', 'CO2 emissions from fossil-fuels', 'CO2 emissions from gas flaring']
df_filter3 = df[(df['Dataset'] == 'CDIACGNCO2015') & (df['Year'] >= 1970) & (df['Indicator'].isin(Indicator3))]
print('The unit of the values are: {}, and needs to be changed into Mt of CO2.'.format(df_filter3['Unit'].unique()[0]))
df_3 = pd.crosstab(df_filter3.Year, df_filter3.Indicator, values = df_filter3.Value/1000/12*44, aggfunc = 'sum').reset_index()
df_3['Total CO2 (Mt)'] = df_3.sum(axis = 1)
df_3.head()

The unit of the values are: Thousand metric tons of carbon, and needs to be changed into Mt of CO2.

Indicator  Year  ...  Total CO2 (Mt)
0          1970  ...    10526.995333
1          1971  ...    10845.077667
2          1972  ...    11300.293333
3          1973  ...    11821.498000
4          1974  ...    11697.798333

[5 rows x 6 columns]

In [ ]:
# No 4: WB % CO2 from different sectors
Indicator4 = ['CO2 emissions from electricity production (%)', 'CO2 emissions from manufacturing industries (%)', 'CO2 emissions from other sectors (%)', 'CO2 emissions: residential buildings (%)', 'CO2 emissions: transport (%)']
df_filter4 = df[(df['Dataset'] == 'WBWDI2019Jan') & (df['Year'] >= 1970) & (df['Indicator'].isin(Indicator4)) & (df['Country'] == 'United States of America')]
print('The unit of the values are: {}.'.format(df_filter4['Unit'].unique()[0]))
df_4 = pd.crosstab(df_filter4.Year, df_filter4.Indicator, values = df_filter4.Value, aggfunc = 'sum')
df_4['Total CO2 (%)'] = df_4.sum(axis = 1)
df_4.reset_index(inplace = True)
df_4.head()

The unit of the values are: %.

Indicator  Year  ...  Total CO2 (%)
0          1970  ...      100.00023
1          1971  ...      100.00001
2          1972  ...      100.00001
3          1973  ...      100.00000
4          1974  ...      100.00000

[5 rows x 7 columns]

In [ ]:
# No 5: WB Mt of CO2 equivalent of methane
Indicator5 = ['Methane emissions']
df_filter5 = df[(df['Dataset'] == 'WBWDI2019Jan') & (df['Year'] >= 1970) & (df['Indicator'].isin(Indicator5))]
print('The unit of the values are: {}, and needs to be changed into Mt.'.format(df_filter5['Unit'].unique()[0]))
df_5 = pd.crosstab(df_filter5.Year, df_filter5.Indicator, values = df_filter5.Value/1000, aggfunc = 'sum')
df_5['Total methane (Mt of CO2 equivalent)'] = df_5.sum(axis = 1)
df_5.reset_index(inplace = True)
df_5.head()

The unit of the values are: kt of CO2 equivalent, and needs to be changed into Mt.

Indicator  Year  Methane emissions  Total methane (Mt of CO2 equivalent)
0          1970          3432.1125                             3432.1125
1          1971          3430.9215                             3430.9215
2          1972          3599.5162                             3599.5162
3          1973          3572.7626                             3572.7626
4          1974          3608.8931                             3608.8931

In [ ]:
# No 6: CDI mt CO2 from gas solid liquid fuels
Indicator6 = ['CO2 emissions from gas fuel consumption', 'CO2 emissions from liquid fuel consumption', 'CO2 emissions from solid fuel consumption']
df_filter6 = df[(df['Dataset'] == 'CDIACGNCO2015') & (df['Year'] >= 1970) & (df['Indicator'].isin(Indicator6))]
print('The unit of the values are: {}, and needs to be changed into Mt of CO2.'.format(df_filter6['Unit'].unique()[0]))
df_6 = pd.crosstab(df_filter6.Year, df_filter6.Indicator, values = df_filter6.Value/1000/12*44, aggfunc = 'sum').reset_index()
df_6['Total CO2 (Mt)'] = df_6.sum(axis = 1)
df_6.head()

The unit of the values are: Thousand metric tons of carbon, and needs to be changed into Mt of CO2.

Indicator  Year  ...  Total CO2 (Mt)
0          1970  ...     9878.886333
1          1971  ...    10143.006333
2          1972  ...    10533.963667
3          1973  ...    10938.755333
4          1974  ...    10823.984000

[5 rows x 5 columns]